{"Title": "NOËSIS", "Date": "31.10.2025", "Description": "Some believe the best techno records are able to express emotion and attitude despite its dissonant and machine like nature; our guiding principle encupsualtes the showcase of records that destill that qualtiy. This night is for anyone who likes cerebral music that is a bit more experimental and takes time and a bit of patience for it to unfold.", "Link": "https://www.clublucia.at/event/noesis/"}
{"Title": "BiRCH! x THE PALAIS", "Date": "23.10.2025", "Description": "Start: 20:00Get ready for an electrifying evening at Lucia Bar in Vienna featuring two powerhouse female-led bands,  and . These talented English-speaking groups will light up the stage with their unique blend of melodic rock and indie pop, delivering music that champions female empowerment and passion.", "Link": "https://www.clublucia.at/event/birch-x-the-palais/"}
{"Title": "VTOROI KA (KG) | EU TOUR 2025", "Date": "24.10.2025", "Description": "Doors: 19:00Start: 20:00Tape Capitol Music presents:VTOROI KA (KG) – First European TourLive in Vienna | 24.10.2025 | Club LuciaPost-punk from Bishkek, Kyrgyzstan aren’t just a band – they’re a phenomenon. Breakbeat meets irony, hip-hop crashes into post-soviet aesthetic, and everything pulses with the urgency of underground nightlife.", "Link": "https://www.clublucia.at/event/vtoroi-ka-kg-eu-tour-2025/"}
{"Title": "COMEUNITYDUB.VIENNA special guest: Alpha Steppa/ RootsMeesenJah HiFi & Treasure Isle", "Date": "24.10.2025", "Description": " at the head of the label Steppas Records, is one of themembers of the collective Dub Dynasty. fruit of the collaboration with his father and his aunt (Alpha & Omega).Ben Alpha aka grew up surrounded by dubplates in sound system culture.", "Link": "https://www.clublucia.at/event/comeunitydub-vienna-special-guest-alpha-steppa-rootsmeesenjah-hifi-treasure-isle/"}
{"Title": "PILE (USA) “Sunshine and Balance Beams”", "Date": "31.10.2025", "Description": "Start: 20:00is the 9th studio album from Boston’s , and their first for Chicago’s Sooper Records. Over 15 years,  has amassed legions of worldwide fans through relentless touring and writing. This resilience and dedication have earned them status as recognized standard bearers of the global rock underground.", "Link": "https://www.clublucia.at/event/pile-usa-sunshine-and-balance-beams/"}
{"Title": "KOAN AKKU – EP RELEASE “Von Flammen ins Licht”", "Date": "05.11.2025", "Description": "Doors: 19:30Start: 20:30End: 22:30 feiern am Mittwoch, 5. November im LUCIA Wien die Veröffentlichung ihrer ersten EP „“. Die Tiroler Mundart-Indie-Rock-Band liefert energiegeladenen Gitarrensound – Sprechgesang im Tiroler Dialekt mit Tiefgang, zwischen Indie-Rock, Post-Rock und progressiven Elementen.", "Link": "https://www.clublucia.at/event/koan-akku-ep-release-von-flammen-ins-licht/"}
{"Title": "SOCIALOOP Semester Opening | Live Band + Clubbing", "Date": "01.11.2025", "Description": "Doors: 20:00Start: 23:30Jedes Jahr werden die Soziologie Erstis aufgerufen, sich zusammenzutun für ein gemeinsames Event von für und mit Studis. Wir haben 2 fixe Gruppen und dieses Jahr wird vermutlich eine weitere dazukommen. Performt werden Covers und eigene Songs im Genre-Mix.", "Link": "https://www.clublucia.at/event/socialoop-semester-opening-live-band-clubbing/"}
{"Title": "GÜRTEL CONNECTION #17", "Date": "25.10.2025", "Description": " = Über 60 Acts & DJs, 14 Locations, 1 Eintritt (Freiwillige Spende) und obendrein noch für einen guten Zweck:Bei der  habt ihr die Möglichkeit, gegen einen einmaligen Eintritt das umfangreiche Programm aller teilnehmenden Lokale in Anspruch zu nehmen.", "Link": "https://www.clublucia.at/event/gurtel-connection-17/"}
{"Title": "Das Schottische Prinzip – Albumpräsentation: „Golden Voyager Record Vol. III”", "Date": "07.11.2025", "Description": "Doors: 20:00Start: 21:00Es ist Spätsommer, und bei unserem Label Bader Molden Recordings herrscht Jubel: Das zweite Album der Band , GOLDEN VOYAGER RECORD VOL. III, steht vor der Tür.", "Link": "https://www.clublucia.at/event/das-schottische-prinzip-albumprasentation-golden-voyager-record-vol-iii/"}
